Jamison Hunter

July 5, 2023

# Books Database

 ![png](books.png)

In [1]:
# Imports
import os
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:root@localhost/books"

In [2]:
engine = create_engine(connection)

In [3]:
#create_database(connection)

In [4]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [5]:
# loading data from local machine
users_path = r"C:\Users\Jamison\Desktop\CODINGDOJO\data\books_data\users.csv"
books_path = r"C:\Users\Jamison\Desktop\CODINGDOJO\data\books_data\books.csv"
authors_path = r"C:\Users\Jamison\Desktop\CODINGDOJO\data\books_data\authors.csv"
favorites_path = r"C:\Users\Jamison\Desktop\CODINGDOJO\data\books_data\users.csv"
# creating data frames
users = pd.read_csv(users_path)
books = pd.read_csv(books_path)
authors = pd.read_csv(authors_path)
favs= pd.read_csv(favorites_path)

In [6]:
users

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [7]:
books

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4
5   6          Frankenstein          5

In [8]:
authors

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [9]:
favs

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [12]:
users.to_sql('users', engine, if_exists = 'replace')
books.to_sql('books', engine, if_exists = 'replace')
authors.to_sql('authors', engine, if_exists = 'replace')
favs.to_sql('favorites', engine, if_exists = 'replace')

3

In [13]:
# checking if the tables exist in the database
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [15]:
q = """SELECT books.title, favorites.id
FROM books
JOIN favorites ON books.id = favorites.id
WHERE favorites.id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""
pd.read_sql(q, engine)

         title  id
0  The Shining   1